app/controllers/school_classes_controller.rb

UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-04-30 19:26:15.074019"], ["id", 1]]
---
  def update
    @school_class.update(school_class_params)