app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-04-30 19:09:04.200674"], ["updated_at", "2019-04-30 19:09:04.200674"]]
---
  def create
    @student = Student.create(students_params)

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-04-30 19:26:15.347849"], ["id", 1]]
---
  def update
    @student.update(students_params)